[
  {"id":"cohenPsychologicalTestingAssessment2022","abstract":"\"Psychological tests and other tools of assessment may differ with respect to a number of variables, such as content, format, administration procedures, scoring and interpretation procedures, and technical quality. The content (subject matter) of the test will, of course, vary with the focus of the particular test. But even two psychological tests purporting to measure the same thing-for example, personality-may differ widely in item content. This is so because two test developers might have entirely different views regarding what is important in measuring \"personality\"; different test developers employ different definitions of \"personality.\" Additionally, different test developers come to the test development process with different theoretical orientations\"--","author":[{"family":"Cohen","given":"Ronald Jay"},{"family":"Schneider","given":"William Joel"},{"family":"Tobin","given":"Renée Margaret"}],"call-number":"BF176 .C63 2021","citation-key":"cohenPsychologicalTestingAssessment2022","edition":"10","event-place":"New York","ISBN":"978-1-260-83702-5","issued":{"date-parts":[[2022]]},"license":"All rights reserved","publisher":"McGraw Hill LLC","publisher-place":"New York","source":"Library of Congress ISBN","title":"Psychological testing and assessment: An introduction to tests and measurement","title-short":"Psychological testing and assessment","type":"book","URL":"https://www.mheducation.com/highered/product/1260837025.html"},
  {"id":"schneiderEssentialsAssessmentReport2018","abstract":"\"The bestselling guide to reporting writing, updated and reworked for today's practice Essentials of Assessment Report Writing offers effective solutions to the creation of reader-friendly, yet targeted, psychological, and educational assessment reports. Parents, clinicians, clients, and other readers need more than test-by-test descriptions&mdash;they need an accessible analysis of the entire situation to determine their next steps. This book provides clear guidance for busy practitioners seeking ways to improve their report writing skills. With a focus on current practice, this new second edition covers DSM-5 updates and the latest assessment instruments including the WJ IV, WISC-V, WAIS-IV, KTEA-3, and the CAS2. New discussion includes advice on tailoring the report to the audience, and annotated case reports provide illustrative models of effective report styles, interpretation, and analysis. Key concepts are highlighted for quick reference throughout, and end-of-chapter questions help reinforce understanding. Reporting styles vary widely within the field, in both content and style; there is no definitive \"standard,\" but many reports fail to reflect best practices and therefore prove less than useful to the reader. This book provides expert guidance throughout the reporting process to help practitioners provide high-quality, accessible reports. Integrate assessment results to provide a person-centered report Identify and navigate critical decision points in the interpretive process Write efficiently yet effectively while enhancing the reader's experience Provide an accurate, informative, and readable assessment report Incorporate practical recommendations to address the referral concerns Expertly-conducted assessments should culminate with a carefully constructed analysis that provides direction via clear communication. Because this report will be used to inform treatment, intervention, and ultimately, the client's quality of life&mdash;it is critical that it provides clear, informative guidance in a way that readers can understand. Essentials of Assessment Report Writing provides comprehensive guidelines for navigating through the report writing process\"--","author":[{"family":"Schneider","given":"William Joel"},{"family":"Mather","given":"Nancy"},{"family":"Lichtenberger","given":"Elizabeth O."},{"family":"Kaufman","given":"Nadeen L."}],"call-number":"RC469","citation-key":"schneiderEssentialsAssessmentReport2018","collection-editor":[{"family":"Kaufman","given":"Alan S."},{"family":"Kaufman","given":"Nadeen L."}],"collection-title":"Essentials of psychological assessment","edition":"2","event-place":"Hoboken, NJ","ISBN":"978-1-119-21874-6 978-1-119-21875-3","issued":{"date-parts":[[2018]]},"license":"All rights reserved","note":"pubid:pUxgyZctzPYC","number-of-pages":"1","publisher":"Wiley","publisher-place":"Hoboken, NJ","source":"Library of Congress ISBN","title":"Essentials of assessment report writing","type":"book","URL":"https://www.wiley.com/en-us/Essentials+of+Assessment+Report+Writing%2C+2nd+Edition-p-9781119218753"}
]
